In [1]:
import pandas as pd, matplotlib as plt, numpy as np

In [2]:
df = pd.read_csv("D:/Degree/codes/Python/DataSet/Perrin Freres monthly champagne sales millions.csv")
df.head()

     Month  Perrin Freres monthly champagne sales millions ?64-?72
0  1964-01                                             2815.0
1  1964-02                                             2672.0
2  1964-03                                             2755.0
3  1964-04                                             2721.0
4  1964-05                                             2946.0

In [4]:
df.columns=["Month","Sales"]
df.head()

     Month   Sales
0  1964-01  2815.0
1  1964-02  2672.0
2  1964-03  2755.0
3  1964-04  2721.0
4  1964-05  2946.0

In [5]:
df.isnull().sum()

Month    1
Sales    2
dtype: int64

In [6]:
df.shape

(107, 2)

In [13]:
df.dropna()

       Month   Sales
0    1964-01  2815.0
1    1964-02  2672.0
2    1964-03  2755.0
3    1964-04  2721.0
4    1964-05  2946.0
..       ...     ...
100  1972-05  4618.0
101  1972-06  5312.0
102  1972-07  4298.0
103  1972-08  1413.0
104  1972-09  5877.0

[105 rows x 2 columns]

In [14]:
df.shape

(107, 2)

In [23]:
df.tail()

       Month   Sales
100  1972-05  4618.0
101  1972-06  5312.0
102  1972-07  4298.0
103  1972-08  1413.0
104  1972-09  5877.0

In [19]:
df.drop(105)

                                                 Month   Sales
0                                              1964-01  2815.0
1                                              1964-02  2672.0
2                                              1964-03  2755.0
3                                              1964-04  2721.0
4                                              1964-05  2946.0
..                                                 ...     ...
101                                            1972-06  5312.0
102                                            1972-07  4298.0
103                                            1972-08  1413.0
104                                            1972-09  5877.0
106  Perrin Freres monthly champagne sales millions...     NaN

[106 rows x 2 columns]

In [22]:
df.drop(105,inplace=True)

In [24]:
df.shape

(105, 2)

In [26]:
df["Month"] = pd.to_datetime(df["Month"])
df.head()

       Month   Sales
0 1964-01-01  2815.0
1 1964-02-01  2672.0
2 1964-03-01  2755.0
3 1964-04-01  2721.0
4 1964-05-01  2946.0